resources/benchmark/synthetic/lb/istio-l7.txt
yizhengx@node0:~$ service0_ip=$(kubectl get svc service0 -o jsonpath='{.spec.clusterIP}'); ~/istio-1.26.0/wrk2/wrk -t4 -c16 -R 50 -d 30 -L http://$service0_ip/endpoint1
Running 30s test @ http://10.103.169.134/endpoint1
  4 threads and 16 connections
  Thread calibration: mean lat.: 64.075ms, rate sampling interval: 234ms
  Thread calibration: mean lat.: 71.530ms, rate sampling interval: 234ms
  Thread calibration: mean lat.: 61.114ms, rate sampling interval: 233ms
  Thread calibration: mean lat.: 70.591ms, rate sampling interval: 234ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    68.30ms   44.91ms 128.26ms   53.75%
    Req/Sec    12.18      5.20    17.00     82.65%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   28.08ms
 75.000%  116.35ms
 90.000%  117.25ms
 99.000%  119.29ms
 99.900%  127.29ms
 99.990%  128.32ms
 99.999%  128.32ms
100.000%  128.32ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      21.807     0.000000            1         1.00
      25.631     0.100000          102         1.11
      26.223     0.200000          200         1.25
      26.671     0.300000          303         1.43
      27.135     0.400000          400         1.67
      28.079     0.500000          500         2.00
     113.599     0.550000          551         2.22
     115.391     0.600000          602         2.50
     115.839     0.650000          655         2.86
     116.159     0.700000          706         3.33
     116.351     0.750000          757         4.00
     116.479     0.775000          782         4.44
     116.607     0.800000          806         5.00
     116.735     0.825000          827         5.71
     116.927     0.850000          851         6.67
     117.119     0.875000          884         8.00
     117.183     0.887500          894         8.89
     117.247     0.900000          905        10.00
     117.375     0.912500          917        11.43
     117.439     0.925000          931        13.33
     117.567     0.937500          938        16.00
     117.695     0.943750          944        17.78
     117.823     0.950000          950        20.00
     118.015     0.956250          958        22.86
     118.207     0.962500          964        26.67
     118.399     0.968750          970        32.00
     118.463     0.971875          975        35.56
     118.463     0.975000          975        40.00
     118.655     0.978125          979        45.71
     118.719     0.981250          982        53.33
     118.911     0.984375          985        64.00
     118.911     0.985938          985        71.11
     119.167     0.987500          987        80.00
     119.295     0.989062          989        91.43
     119.487     0.990625          990       106.67
     119.935     0.992188          992       128.00
     119.935     0.992969          992       142.22
     119.999     0.993750          993       160.00
     120.191     0.994531          994       182.86
     124.991     0.995313          995       213.33
     125.055     0.996094          996       256.00
     125.055     0.996484          996       284.44
     125.055     0.996875          996       320.00
     126.911     0.997266          997       365.71
     126.911     0.997656          997       426.67
     127.295     0.998047          998       512.00
     127.295     0.998242          998       568.89
     127.295     0.998437          998       640.00
     127.295     0.998633          998       731.43
     127.295     0.998828          998       853.33
     128.319     0.999023          999      1024.00
     128.319     1.000000          999          inf
#[Mean    =       68.299, StdDeviation   =       44.913]
#[Max     =      128.256, Total count    =          999]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1504 requests in 30.02s, 419.26KB read
Requests/sec:     50.09
Transfer/sec:     13.96KB
yizhengx@node0:~$ 

yizhengx@node0:~$ kubectl logs service1-7b49bf6b7d-cjdwd   | wc -l
827
yizhengx@node0:~$ kubectl logs service1-busy-6457fcbd4b-7mxch | wc -l
683