resources/benchmark/synthetic/lb/round-robin.txt
service0_ip=$(kubectl get svc service0 -o jsonpath='{.spec.clusterIP}'); ~/istio-1.26.0/wrk2/wrk -t4 -c16 -R 50 -d 30 -L http://$service0_ip/endpoint1
Running 30s test @ http://10.104.179.218/endpoint1
  4 threads and 16 connections
  Thread calibration: mean lat.: 69.471ms, rate sampling interval: 233ms
  Thread calibration: mean lat.: 72.077ms, rate sampling interval: 234ms
  Thread calibration: mean lat.: 75.076ms, rate sampling interval: 234ms
  Thread calibration: mean lat.: 71.082ms, rate sampling interval: 233ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    71.36ms   45.24ms 120.45ms   58.80%
    Req/Sec    12.16      4.74    21.00     89.12%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  114.50ms
 75.000%  116.22ms
 90.000%  116.74ms
 99.000%  118.59ms
 99.900%  120.32ms
 99.990%  120.51ms
 99.999%  120.51ms
100.000%  120.51ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      21.871     0.000000            1         1.00
      25.007     0.100000          100         1.11
      25.711     0.200000          203         1.25
      26.127     0.300000          301         1.43
      26.607     0.400000          401         1.67
     114.495     0.500000          500         2.00
     115.199     0.550000          551         2.22
     115.583     0.600000          608         2.50
     115.839     0.650000          658         2.86
     116.031     0.700000          700         3.33
     116.223     0.750000          769         4.00
     116.287     0.775000          794         4.44
     116.351     0.800000          803         5.00
     116.479     0.825000          846         5.71
     116.543     0.850000          861         6.67
     116.607     0.875000          881         8.00
     116.671     0.887500          889         8.89
     116.735     0.900000          900        10.00
     116.863     0.912500          916        11.43
     117.055     0.925000          931        13.33
     117.183     0.937500          942        16.00
     117.247     0.943750          947        17.78
     117.375     0.950000          952        20.00
     117.439     0.956250          958        22.86
     117.503     0.962500          963        26.67
     117.695     0.968750          969        32.00
     117.887     0.971875          973        35.56
     117.951     0.975000          976        40.00
     118.079     0.978125          980        45.71
     118.207     0.981250          982        53.33
     118.399     0.984375          986        64.00
     118.399     0.985938          986        71.11
     118.463     0.987500          988        80.00
     118.591     0.989062          990        91.43
     118.655     0.990625          991       106.67
     118.911     0.992188          993       128.00
     118.911     0.992969          993       142.22
     119.295     0.993750          994       160.00
     119.615     0.994531          996       182.86
     119.615     0.995313          996       213.33
     119.807     0.996094          997       256.00
     119.807     0.996484          997       284.44
     119.807     0.996875          997       320.00
     120.063     0.997266          998       365.71
     120.063     0.997656          998       426.67
     120.319     0.998047          999       512.00
     120.319     0.998242          999       568.89
     120.319     0.998437          999       640.00
     120.319     0.998633          999       731.43
     120.319     0.998828          999       853.33
     120.511     0.999023         1000      1024.00
     120.511     1.000000         1000          inf
#[Mean    =       71.365, StdDeviation   =       45.244]
#[Max     =      120.448, Total count    =         1000]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1504 requests in 30.03s, 419.33KB read
Requests/sec:     50.09
Transfer/sec:     13.97KB


yizhengx@node0:~$ kubectl get pods
NAME                             READY   STATUS    RESTARTS   AGE
service0-c6875b968-8k6jp         2/2     Running   0          49s
service1-7b49bf6b7d-h4rgn        2/2     Running   0          48s
service1-busy-6457fcbd4b-rbsm5   2/2     Running   0          48s
yizhengx@node0:~$ kubectl logs service1-7b49bf6b7d-h4rgn  | wc -l
756